# ViewId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CADLinkOptions..::..ViewId Property
CADLinkOptions Class See Also
---
The id of the view to use as the link's reference view, if the reference view has been deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public ElementId ViewId { get; set; }
```

Visual Basic
---
```text
Public Property ViewId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ ViewId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
CADLinkOptions Class
Autodesk.Revit.DB Namespace